import { AfterStoryType } from "../types/afterStoryType";

export const AfterStorytData: Record<string, AfterStoryType> = {
  yaku: {
    name: "ขนมข้าวยาคู",
    nameDescription:
      "มีความหมายสื่อถึงการให้อายุ วรรณะ สุข กำลัง และปฏิภาณผู้มีปัญญา",
    meaning:
      "       หยิบยกประเด็นเรื่องความเป็นอมตะมาเรียบเรียงใหม่ โดยให้ข้อคิดว่าไม่ควรคาดหวังการมีชีวิตอมตะจากผู้อื่น จึงนำประเด็นทางสังคมที่กำลังเกิดข้อถกเถียงกันในขณะนี้ คือการที่ผู้คนในสังคมส่วนใหญ่ต้องการมีลูกเพื่อให้สามารถเลี้ยงดูได้ในยามแก่เฒ่า และนั่นเป็นการตอบแทนบุญคุณต่อผู้ให้กำเนิดที่ผู้เป็นลูกต้องพึงกระทำ แต่ผู้คนในสังคมกลับไม่ได้หยั่งลึกไปถึงความพร้อมในการมีลูก อีกทั้งยังประณามและเสียดสีถึงบุคคลที่ไม่สามารถทดแทนบุญคุณได้ ตลอดจนประเด็นของสถานรับเลี้ยงเด็กกำพร้าที่ยังมีอีกด้านที่ไม่ได้ถูกนำเสนอหรือไม่ได้มีการพูดถึงในวงกว้างมาเป็นเส้นเรื่องหลัก",
  },
  penny: {
    name: "ขนมสัมปันนี",
    nameDescription: "มีความหมายสื่อถึงการเป็นที่รัก ความคิดถึง ความห่วงใย",
    meaning:
      "       หยิบยกข้อคิดของการรักตัวเองขึ้นมาผนวกกับประเด็นทางสังคมของการเป็นแม่เลี้ยงเดี่ยว ที่ทั้งช่วงชีวิตของผู้เป็นแม่จะต้องอุทิศตนเองเพื่อเลี้ยงดูลูกให้เติบโตไปเป็นบุคคลที่มีคุณภาพในสังคม และไม่รู้สึกว่าตนเองเติบโตมาโดยขาดความรักความอบอุ่นจากผู้เป็นพ่อ ซึ่งนั่นแลกมาด้วยการต้องสละอิสรภาพชีวิตในวัยหนุ่มสาวของตนเองไปอย่างน่าเสียดาย แต่ในบางกรณี โดยเฉพาะปัจจุบันที่เทคโนโลยีกำลังเป็นส่วนหนึ่งของชีวิตประจำวัน ผู้ปกครองจึงมักจะทิ้งลูกเอาไว้กับโทรศัพท์ หรือสื่ออิเล็กทรอนิกส์ต่างๆ โดยละเลยหน้าที่ของตนไปจนอาจเกิดผลเสียที่กระทบต่อเด็กเอง",
  },
};
